"""
生成一份模拟的数据，并写入到文件中
"""

import random

xings_list = [
    '赵', '钱', '孙', '李', '周', '吴', '郑', '王', '冯', '陈', '褚', '卫',
    '蒋', '沈', '韩', '杨', '朱', '秦', '尤', '许', '何', '吕', '施', '张',
    '孔', '曹', '严', '华', '金', '魏', '陶', '姜', '戚', '谢', '邹', '喻',
    '柏', '水', '窦', '章', '云', '苏', '潘', '葛', '奚', '范', '彭', '郎',
    '鲁', '韦', '昌', '马', '苗', '凤', '花', '方', '俞', '任', '袁', '柳',
    '酆', '鲍', '史', '唐', '费', '廉', '岑', '薛', '雷', '贺', '倪', '汤',
    '滕', '殷', '罗', '毕', '郝', '邬', '安', '常', '乐', '于', '时', '傅',
    '皮', '卞', '齐', '康', '伍', '余', '元', '卜', '顾', '孟', '平', '黄',
    '和', '穆', '萧', '尹', '姚', '邵', '湛', '汪', '祁', '毛', '禹', '狄',
    '米', '贝', '明', '臧', '计', '伏', '成', '戴', '谈', '宋', '茅', '庞',
    '熊', '纪', '舒', '屈', '项', '祝', '董', '梁', '杜', '阮', '蓝', '闵',
    '席', '季', '麻', '强', '贾', '路', '娄', '危', '江', '童', '颜', '郭',
    '梅', '盛', '林', '刁', '钟', '徐', '邱', '骆', '高', '夏', '蔡', '田',
    '樊', '胡', '凌', '霍', '虞', '万', '支', '柯', '昝', '管', '卢', '莫',
    '经', '房', '裘', '缪', '干', '解', '应', '宗', '丁', '宣', '贲', '邓',
    '郁', '单', '杭', '洪', '包', '诸', '左', '石', '崔', '吉', '钮', '龚',
    '程', '嵇', '邢', '滑', '裴', '陆', '荣', '翁', '荀', '羊', '於', '惠',
    '甄', '曲', '家', '封', '芮', '羿', '储', '靳', '汲', '邴', '糜', '松',
    '井', '段', '富', '巫', '乌', '焦', '巴', '弓', '牧', '隗', '山', '谷',
    '车', '侯', '宓', '蓬', '全', '郗', '班', '仰', '秋', '仲', '伊', '宫',
    '宁', '仇', '栾', '暴', '甘', '钭', '厉', '戎', '祖', '武', '符', '刘',
    '景', '詹', '束', '龙', '叶', '幸', '司', '韶', '郜', '黎', '蓟', '薄',
    '印', '宿', '白', '怀', '蒲', '邰', '从', '鄂', '索', '咸', '籍', '赖',
    '卓', '蔺', '屠', '蒙', '池', '乔', '阴', '郁', '胥', '能', '苍', '双',
    '闻', '莘', '党', '翟', '谭', '贡', '劳', '逄', '姬', '申', '扶', '堵',
    '冉', '宰', '郦', '雍', '郤', '璩', '桑', '桂', '濮', '牛', '寿', '通',
    '边', '扈', '燕', '冀', '郏', '浦', '尚', '农', '温', '别', '庄', '晏',
    '柴', '瞿', '阎', '充', '慕', '连', '茹', '习', '宦', '艾', '鱼', '容',
    '向', '古', '易', '慎', '戈', '廖', '庾', '终', '暨', '居', '衡', '步',
    '都', '耿', '满', '弘', '匡', '国', '文', '寇', '广', '禄', '阙', '东',
    '欧', '殳', '沃', '利', '蔚', '越', '夔', '隆', '师', '巩', '厍', '聂',
    '晁', '勾', '敖', '融', '冷', '訾', '辛', '阚', '那', '简', '饶', '空',
    '曾', '毋', '沙', '乜', '养', '鞠', '须', '丰', '巢', '关', '蒯', '相',
    '查', '後', '荆', '红', '游', '竺', '权', '逯', '盖', '益', '桓', '公',
    '仉', '督', '晋', '楚', '闫', '法', '汝', '鄢', '涂', '钦', '归', '海',
    '岳', '帅', '缑', '亢', '况', '后', '有', '琴', '商', '牟', '佘', '佴',
    '伯', '赏', '墨', '哈', '谯', '笪', '年', '爱', '阳', '佟', '言', '福']
mings_list = ['大', '二', '三', '四', '五', '六', '七', '八', '九', '十']
add_score_things = ["点赞", "投币", "转发", "收藏", "三连"]
reduce_score_things = ["点踩", "抬杠", "抹黑", "拱火", "白嫖"]

names = []  # [(1, "张三"), (2, "李四"), ...]
records = []  # [((1, "张三"), "点赞", (2, "李四"), 1), ...] 张三点赞李四，加1分


def mock_names():
    """创建 100 个 (id_num, name)"""
    for i in range(1, 101):
        xing = random.choice(xings_list)
        ming = random.choice(mings_list)
        names.append((i, xing + ming))


def mock_records():
    """创建 10,000 条来往记录"""
    things = add_score_things + reduce_score_things
    for _ in range(10000):
        name1 = random.choice(names)
        name2 = random.choice(names)
        while name1 == name2:
            name2 = random.choice(names)
        thing = random.choice(things)
        score = 1 if things.index(thing) < len(add_score_things) else -1
        records.append(f"{name1}, '{thing}', {name2}, {score}")


def save_to_file():
    with open("names.txt", 'w', encoding="utf-8") as f1:
        for idx, name in names:
            f1.write(f"{idx} {name}\n")
    with open("records.txt", 'w', encoding="utf-8") as f2:
        for record in records:
            f2.write(record + '\n')


def mock_data():
    print("generating mock data...")
    mock_names()
    mock_records()
    save_to_file()
    print("finished generating mock data.")
    return names, records


if __name__ == "__main__":
    mock_data()
    print(names[:10])
    print('-' * 10)
    print(records[:10])
